src/cf/Documents/ВедомостьНаВыплатуЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ВедомостьНаВыплатуЗарплаты</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидМестаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМестВыплатыЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыплатыЗарплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДнейНеВыплаты</Name>
					<Comment>Количество дней, на которые задержана выплата зарплаты</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.БанковскиеСчетаФизическихЛиц</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыплаченностьЗарплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВыплаченностьЗарплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпенсацияЗаЗадержкуЗарплаты</Name>
							<Comment>Компенсация за нарушение установленного срока выплаты зарплаты в соответствии со ст.236 Трудового Кодекса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/ОплатаВедомостейНаВыплатуЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОплатаВедомостейНаВыплатуЗарплаты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ведомость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплаты</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыВБанк</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыплатуЗарплатыВКассу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыМестВыплатыЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыМестВыплатыЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Касса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатныйПроект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Раздатчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВыплаченностьЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВыплаченностьЗарплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задепонировано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ВедомостьНаВыплатуЗарплаты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов


// Получение данных о документах подсистемы зарплата.
//
// Параметры:
//	Ведомости			- массив документов ВедомостьНаВыплатуЗарплаты.
//	ФизическиеЛица		- массив элементов справочника ФизическиеЛица, чьи данные необходимо получить из ведомостей.
//	ФормаРасчетов		- ПеречислениеСсылка.ФормыОплаты, определяющая, какие ведомости необходимо вернуть: наличные или
//	                 безналичные.
//	Регистратор			- ссылка на документ оплаты, для заполнения которого используется получение данных ведомостей, 
//							нужен для того, чтобы игнорировать движения.
//
// Возвращаемое значение:
//	ТаблицаЗначений с колонками:
//		ФизическоеЛицо					- тип СправочникСсылка.ФизическиеЛица.
//		СуммаКВыплате					- тип Число.
//		КомпенсацияЗаЗадержкуЗарплаты	- тип Число.
//		Ведомость						- тип ДокументСсылка.ВедомостьНаВыплатуЗарплаты.
//
Функция ДанныеВедомостей(Ведомости, ФормаРасчетов, ФизическиеЛица = Неопределено, ВыплатаДепонентов = Неопределено, Регистратор = Неопределено) Экспорт
	
	ВидМестаВыплаты = Новый Массив;
	Если ФормаРасчетов = Перечисления.ФормыОплаты.Безналичная Тогда
		ВидМестаВыплаты.Добавить(Перечисления.ВидыМестВыплатыЗарплаты.БанковскийСчет);
		ВидМестаВыплаты.Добавить(Перечисления.ВидыМестВыплатыЗарплаты.ЗарплатныйПроект);
		
	Иначе
		ВидМестаВыплаты.Добавить(Перечисления.ВидыМестВыплатыЗарплаты.Касса);
		ВидМестаВыплаты.Добавить(Перечисления.ВидыМестВыплатыЗарплаты.Раздатчик);
		
		Если ВыплатаДепонентов = Неопределено Тогда
			ВыплатаДепонентов = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВыплатаДепонентов = Истина Тогда
		УсловиеПоДепонированию =
		"ВедомостьНаВыплатуЗарплатыЗарплата.ВыплаченностьЗарплаты = ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано)";
		
	ИначеЕсли ВыплатаДепонентов = Ложь Тогда
		УсловиеПоДепонированию =
		"НЕ ВедомостьНаВыплатуЗарплатыЗарплата.ВыплаченностьЗарплаты В (ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.НеВыплачено), ЗНАЧЕНИЕ(Перечисление.ВыплаченностьЗарплаты.Задепонировано))";
		
	Иначе // Неопределено
		УсловиеПоДепонированию = "ИСТИНА";
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВедомостьНаВыплатуЗарплатыЗарплата.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ВедомостьНаВыплатуЗарплатыЗарплата.Сумма КАК СуммаКВыплате,
	|	ВедомостьНаВыплатуЗарплатыЗарплата.БанковскийСчет КАК БанковскийСчет,
	|	ВедомостьНаВыплатуЗарплатыЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК КомпенсацияЗаЗадержкуЗарплаты,
	|	ВедомостьНаВыплатуЗарплатыЗарплата.Ссылка КАК Ведомость,
	|	ВедомостьНаВыплатуЗарплатыЗарплата.Сумма + ВедомостьНаВыплатуЗарплатыЗарплата.КомпенсацияЗаЗадержкуЗарплаты КАК ИтогоКВыплате
	|ИЗ
	|	Документ.ВедомостьНаВыплатуЗарплаты.Зарплата КАК ВедомостьНаВыплатуЗарплатыЗарплата
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты КАК ОплатаВедомостейНаВыплатуЗарплаты
	|		ПО (ОплатаВедомостейНаВыплатуЗарплаты.Ведомость = ВедомостьНаВыплатуЗарплатыЗарплата.Ссылка)
	|			И (ОплатаВедомостейНаВыплатуЗарплаты.ФизическоеЛицо = ВедомостьНаВыплатуЗарплатыЗарплата.ФизическоеЛицо)
	|			И (ОплатаВедомостейНаВыплатуЗарплаты.Регистратор <> &Регистратор)
	|ГДЕ
	|	ВедомостьНаВыплатуЗарплатыЗарплата.Ссылка В(&Ведомости)
	|	И (&ПоВсемФизлицам
	|			ИЛИ ВедомостьНаВыплатуЗарплатыЗарплата.ФизическоеЛицо В (&ФизическиеЛица))
	|	И ВедомостьНаВыплатуЗарплатыЗарплата.Ссылка.ВидМестаВыплаты В(&ВидМестаВыплаты)
	|	И ОплатаВедомостейНаВыплатуЗарплаты.ФизическоеЛицо ЕСТЬ NULL 
	|	И &УсловиеПоДепонированию";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДепонированию", УсловиеПоДепонированию);
	
	Запрос.УстановитьПараметр("Ведомости",			Ведомости);
	Запрос.УстановитьПараметр("ПоВсемФизлицам",		ФизическиеЛица = Неопределено);
	Запрос.УстановитьПараметр("ФизическиеЛица",		ФизическиеЛица);
	Запрос.УстановитьПараметр("ВидМестаВыплаты",	ВидМестаВыплаты);
	Запрос.УстановитьПараметр("Регистратор",		Регистратор);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#КонецЕсли
